In [1]:
import pandas as pd
import os

In [2]:
school_data_to_load = os.path.join('Resources','schools_complete.csv')
student_data_to_load = os.path.join('Resources', 'students_complete.csv')
clean_student_to_load = os.path.join("Resources" , "clean_students_complete.csv")

In [3]:
school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)
clean_student_data_df = pd.read_csv(clean_student_to_load)

In [4]:
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [7]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [8]:
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [9]:
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [10]:
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [11]:
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [12]:
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [13]:
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [14]:
prefixes_and_suffixes = [' MD', ' DVM', ' DDS', ' PhD', 'Dr. ', 'Mr. ', 'Miss ', 'Mrs. ', 'Ms. ']

In [15]:
for word in prefixes_and_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")
student_data_df['student_name']

0           Paul Bradley
1           Victor Smith
2        Kevin Rodriguez
3          Richard Scott
4             Bonnie Ray
              ...
39165       Donna Howard
39166          Dawn Bell
39167     Rebecca Tanner
39168       Desiree Kidd
39169    Carolyn Jackson
Name: student_name, Length: 39170, dtype: object

In [16]:
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [17]:
student_list=student_data_df["student_name"].tolist()
students_to_fix =[]
suffix = []
prefix = []
for student in student_list:
    student_name = student.split()
    if len(student_name) >= 3:
        students_to_fix.append(student)
students_to_fix
for student in students_to_fix:
    student_name = student.split()
    if student_name[-1] not in suffix:
        suffix.append(student_name[-1])
    if student_name[0] not in prefix:
        prefix.append(student_name[0])
print(suffix)
print(prefix)

['III', 'II', 'Jr.', 'IV', 'V']
['Joseph', 'Xavier', 'David', 'Reginald', 'Kevin', 'William', 'Juan', 'Kenneth', 'Scott', 'Mark', 'Michael', 'Sean', 'Cody', 'Mathew', 'Jason', 'Leonard', 'Ryan', 'Allen', 'Calvin', 'Ronald', 'Gabriel', 'Brian', 'Bruce', 'Jeremy', 'Austin', 'Bryan', 'Robert', 'Eric', 'Jon', 'Andrew', 'Raymond', 'Jeffrey', 'Matthew', 'Jacob', 'Dennis', 'Jimmy', 'James', 'Jeffery', 'Derrick', 'Joshua', 'Timothy', 'Lonnie', 'Tyrone', 'Lance', 'Noah', 'Victor', 'Richard', 'Charles', 'Jonathan', 'Aaron', 'Daniel', 'Christopher', 'Derek', 'Zachary', 'Thomas', 'Jeremiah', 'Larry', 'Cameron', 'Todd', 'Dwayne', 'Colton', 'Chris', 'Tyler', 'Carlos', 'Adam', 'Roger', 'Cory', 'Philip', 'Greg', 'Erik', 'Omar', 'Duane', 'Seth', 'Anthony', 'Edward', 'George', 'Dylan', 'Taylor', 'Tony', 'Keith', 'Colin', 'Terry', 'Steven', 'Lucas']

In [18]:
print(clean_student_data_df.columns)
print(school_data_df.columns)

Index(['Unnamed: 0', 'Student ID', 'student_name', 'gender', 'grade',
       'school_name', 'reading_score', 'math_score'],
      dtype='object')
Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [19]:
clean_student_data_df

,Unnamed: 0,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...,...
39165,39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [20]:
school_data_complete_df = pd.merge(clean_student_data_df,school_data_df,on=['school_name','school_name'])
school_data_complete_df.head()

,Unnamed: 0,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [21]:
student_count = school_data_complete_df['student_name'].count()
student_count

39170

In [22]:
schools_count = len(school_data_complete_df['school_name'].unique())
schools_count

15

In [23]:
total_budget = school_data_df['budget'].sum()
total_budget

24649428

In [24]:
mean_math_total = school_data_complete_df['math_score'].mean()
mean_reading_total = school_data_complete_df['reading_score'].mean()
print(mean_math_total)
print(mean_reading_total)

78.98537145774827
81.87784018381414

In [25]:
passing_math_df = school_data_complete_df[school_data_complete_df['math_score'] >= 70]
passing_reading_df = school_data_complete_df[school_data_complete_df['reading_score'] >= 70]
students_passing_math = passing_math_df['math_score'].count()
students_passing_reading = passing_reading_df['reading_score'].count()
print(students_passing_math)
print(students_passing_reading)

29370
33610

In [26]:
percent_pass_math = passing_math_df['Student ID'].count() / school_data_complete_df['Student ID'].count() *100
percent_pass_reading = passing_reading_df ['Student ID'].count() / school_data_complete_df['Student ID'].count() *100
print(percent_pass_math)
print(percent_pass_reading)

74.9808526933878
85.80546336482001

In [27]:
pass_math_reading_df = school_data_complete_df[(school_data_complete_df['math_score']>=70) & 
                                          (school_data_complete_df['reading_score']>=70)]
percent_pass_all = pass_math_reading_df['Student ID'].count() / school_data_complete_df['Student ID'].count() *100
print(percent_pass_all)

65.17232575950983

In [28]:
district_summary_df = pd.DataFrame([{'Total Schools':schools_count,
                                   'Total Students':student_count,
                                   'Total Budget': total_budget,
                                   'Average Reading Score':mean_reading_total,
                                   'Average Math Score': mean_math_total,
                                   '% Passing Reading': percent_pass_reading,
                                   '% Passing Math': percent_pass_math,
                                   '% Overall Passing': percent_pass_all}])
district_summary_df
district_summary_df.dtypes

Total Schools              int64
Total Students             int64
Total Budget               int64
Average Reading Score    float64
Average Math Score       float64
% Passing Reading        float64
% Passing Math           float64
% Overall Passing        float64
dtype: object

In [29]:
district_summary_df['Total Schools'] = district_summary_df['Total Schools'].map("{:,}".format)
district_summary_df['Total Students'] = district_summary_df['Total Students'].map("{:,}".format)
district_summary_df['Total Budget'] = district_summary_df['Total Budget'].map("${:,.2f}".format)
district_summary_df['Average Reading Score'] = district_summary_df['Average Reading Score'].map("{:.1f}".format)
district_summary_df['Average Math Score'] = district_summary_df['Average Math Score'].map("{:.1f}".format)
district_summary_df['% Passing Reading'] = district_summary_df['% Passing Reading'].map("{:.0f}".format)
district_summary_df['% Passing Math'] = district_summary_df['% Passing Math'].map("{:.0f}".format)
district_summary_df['% Overall Passing'] = district_summary_df['% Overall Passing'].map("{:.0f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Reading Score,Average Math Score,% Passing Reading,% Passing Math,% Overall Passing
0,15,"39,170","$24,649,428.00",81.9,79.0,86,75,65

In [30]:
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", 
                    "% Passing Math", "% Passing Reading", "% Overall Passing"]
district_summary_data_reorder_df = district_summary_df[new_column_order].copy()

In [31]:
district_summary_data_reorder_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [32]:
per_school_types = school_data_df.set_index(['school_name'])['type']
per_school_types
per_school_types_df = pd.DataFrame(per_school_types)
per_school_types_df

                           type
school_name
Huang High School      District
Figueroa High School   District
Shelton High School     Charter
Hernandez High School  District
Griffin High School     Charter
Wilson High School      Charter
Cabrera High School     Charter
Bailey High School     District
Holden High School      Charter
Pena High School        Charter
Wright High School      Charter
Rodriguez High School  District
Johnson High School    District
Ford High School       District
Thomas High School      Charter

In [33]:
per_school_counts = school_data_complete_df['school_name'].value_counts()
per_school_counts

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [34]:
per_school_budget = school_data_df.set_index(['school_name'])['budget']
per_school_budget

school_name
Huang High School        1910635
Figueroa High School     1884411
Shelton High School      1056600
Hernandez High School    3022020
Griffin High School       917500
Wilson High School       1319574
Cabrera High School      1081356
Bailey High School       3124928
Holden High School        248087
Pena High School          585858
Wright High School       1049400
Rodriguez High School    2547363
Johnson High School      3094650
Ford High School         1763916
Thomas High School       1043130
Name: budget, dtype: int64

In [35]:
budget_per_student_per_school = per_school_budget / per_school_counts
budget_per_student_per_school

Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [36]:
math_reading_avg = school_data_complete_df.groupby(['school_name']).mean()[['reading_score','math_score']]
math_reading_avg_df = pd.DataFrame(math_reading_avg)
math_reading_avg_df.head(2)

                     reading_score  math_score
school_name
Bailey High School       81.033963   77.048432
Cabrera High School      83.975780   83.061895

In [37]:
per_school_passing_math_df=pd.DataFrame(passing_math_df.groupby(['school_name'])['math_score'].count())
per_school_passing_reading_df = pd.DataFrame(passing_reading_df.groupby(['school_name'])['reading_score'].count())

per_school_passing_math_df.head(2)

                     math_score
school_name
Bailey High School         3318
Cabrera High School        1749

In [38]:
per_school_passing_math_df = per_school_passing_math_df.rename(columns={'math_score':'students_passed_math'})
per_school_passing_reading_df = per_school_passing_reading_df.rename(columns={'reading_score':'students_passed_reading'})
per_school_pct_pass_math = per_school_passing_math_df['students_passed_math'] / per_school_counts * 100
per_school_pct_pass_reading = per_school_passing_reading_df['students_passed_reading'] / per_school_counts * 100

In [39]:
per_school_pass_math_reading_df = pd.DataFrame(pass_math_reading_df.groupby(['school_name'])['math_score'].count())
per_school_pass_math_reading_df = per_school_pass_math_reading_df.rename(columns={'math_score':'students_passed_both'})

In [40]:
# per_school_data_summary_df = pd.merge(math_reading_avg_df,per_school_passing_math_df,per_school_passing_reading_df,
#                                       per_school_pass_math_reading_df,on='school_name')
per_school_data_summary_df = math_reading_avg_df.merge(per_school_passing_math_df,how="left",on=['school_name'])

per_school_data_summary_df = per_school_data_summary_df.merge(per_school_passing_reading_df,how='left',on=['school_name'])
per_school_data_summary_df

,reading_score,math_score,students_passed_math,students_passed_reading
school_name,,,,
Bailey High School,81.033963,77.048432,3318,4077
Cabrera High School,83.975780,83.061895,1749,1803
Figueroa High School,81.158020,76.711767,1946,2381
Ford High School,80.746258,77.102592,1871,2172
Griffin High School,83.816757,83.351499,1371,1426
Hernandez High School,80.934412,77.289752,3094,3748
Holden High School,83.814988,83.803279,395,411
Huang High School,81.182722,76.629414,1916,2372
Johnson High School,80.966394,77.072464,3145,3867
Pena High School,84.044699,83.839917,910,923
Rodriguez High School,80.744686,76.842711,2654,3208
Shelton High School,83.725724,83.359455,1653,1688
Thomas High School,83.848930,83.418349,1525,1591
Wilson High School,83.989488,83.274201,2143,2204
Wright High School,83.955000,83.682222,1680,1739

In [41]:

per_school_pass_both_df = pd.DataFrame(pass_math_reading_df.groupby(['school_name'])['math_score'].count())
per_school_pass_both_df = per_school_pass_both_df.rename(columns={'math_score':'students_passing_both'})
per_school_pass_both_df

                       students_passing_both
school_name
Bailey High School                      2719
Cabrera High School                     1697
Figueroa High School                    1569
Ford High School                        1487
Griffin High School                     1330
Hernandez High School                   2481
Holden High School                       381
Huang High School                       1561
Johnson High School                     2549
Pena High School                         871
Rodriguez High School                   2119
Shelton High School                     1583
Thomas High School                      1487
Wilson High School                      2068
Wright High School                      1626

In [42]:
per_school_data_summary_df = per_school_data_summary_df.merge(per_school_pass_both_df,how='left',on=['school_name'])
per_school_data_summary_df

,reading_score,math_score,students_passed_math,students_passed_reading,students_passing_both
school_name,,,,,
Bailey High School,81.033963,77.048432,3318,4077,2719
Cabrera High School,83.975780,83.061895,1749,1803,1697
Figueroa High School,81.158020,76.711767,1946,2381,1569
Ford High School,80.746258,77.102592,1871,2172,1487
Griffin High School,83.816757,83.351499,1371,1426,1330
Hernandez High School,80.934412,77.289752,3094,3748,2481
Holden High School,83.814988,83.803279,395,411,381
Huang High School,81.182722,76.629414,1916,2372,1561
Johnson High School,80.966394,77.072464,3145,3867,2549
Pena High School,84.044699,83.839917,910,923,871
Rodriguez High School,80.744686,76.842711,2654,3208,2119
Shelton High School,83.725724,83.359455,1653,1688,1583
Thomas High School,83.848930,83.418349,1525,1591,1487
Wilson High School,83.989488,83.274201,2143,2204,2068
Wright High School,83.955000,83.682222,1680,1739,1626

In [43]:
per_school_data_summary_df['students_per_school'] = per_school_counts

In [44]:
per_school_data_summary_df

,reading_score,math_score,students_passed_math,students_passed_reading,students_passing_both,students_per_school
school_name,,,,,,
Bailey High School,81.033963,77.048432,3318,4077,2719,4976
Cabrera High School,83.975780,83.061895,1749,1803,1697,1858
Figueroa High School,81.158020,76.711767,1946,2381,1569,2949
Ford High School,80.746258,77.102592,1871,2172,1487,2739
Griffin High School,83.816757,83.351499,1371,1426,1330,1468
Hernandez High School,80.934412,77.289752,3094,3748,2481,4635
Holden High School,83.814988,83.803279,395,411,381,427
Huang High School,81.182722,76.629414,1916,2372,1561,2917
Johnson High School,80.966394,77.072464,3145,3867,2549,4761
Pena High School,84.044699,83.839917,910,923,871,962
Rodriguez High School,80.744686,76.842711,2654,3208,2119,3999
Shelton High School,83.725724,83.359455,1653,1688,1583,1761
Thomas High School,83.848930,83.418349,1525,1591,1487,1635
Wilson High School,83.989488,83.274201,2143,2204,2068,2283
Wright High School,83.955000,83.682222,1680,1739,1626,1800

In [45]:
per_school_data_summary_df['school budget'] = per_school_budget
per_school_data_summary_df

,reading_score,math_score,students_passed_math,students_passed_reading,students_passing_both,students_per_school,school budget
school_name,,,,,,,
Bailey High School,81.033963,77.048432,3318,4077,2719,4976,3124928
Cabrera High School,83.975780,83.061895,1749,1803,1697,1858,1081356
Figueroa High School,81.158020,76.711767,1946,2381,1569,2949,1884411
Ford High School,80.746258,77.102592,1871,2172,1487,2739,1763916
Griffin High School,83.816757,83.351499,1371,1426,1330,1468,917500
Hernandez High School,80.934412,77.289752,3094,3748,2481,4635,3022020
Holden High School,83.814988,83.803279,395,411,381,427,248087
Huang High School,81.182722,76.629414,1916,2372,1561,2917,1910635
Johnson High School,80.966394,77.072464,3145,3867,2549,4761,3094650
Pena High School,84.044699,83.839917,910,923,871,962,585858
Rodriguez High School,80.744686,76.842711,2654,3208,2119,3999,2547363
Shelton High School,83.725724,83.359455,1653,1688,1583,1761,1056600
Thomas High School,83.848930,83.418349,1525,1591,1487,1635,1043130
Wilson High School,83.989488,83.274201,2143,2204,2068,2283,1319574
Wright High School,83.955000,83.682222,1680,1739,1626,1800,1049400

In [46]:
per_school_data_summary_df['school type'] = per_school_types_df
per_school_data_summary_df.head()

,reading_score,math_score,students_passed_math,students_passed_reading,students_passing_both,students_per_school,school budget,school type
school_name,,,,,,,,
Bailey High School,81.033963,77.048432,3318,4077,2719,4976,3124928,District
Cabrera High School,83.975780,83.061895,1749,1803,1697,1858,1081356,Charter
Figueroa High School,81.158020,76.711767,1946,2381,1569,2949,1884411,District
Ford High School,80.746258,77.102592,1871,2172,1487,2739,1763916,District
Griffin High School,83.816757,83.351499,1371,1426,1330,1468,917500,Charter

In [47]:
per_school_data_summary_df['overall_passing_percentage'] = per_school_data_summary_df['students_passing_both'] / per_school_data_summary_df['students_per_school']*100
per_school_data_summary_df['% passing math'] = per_school_data_summary_df['students_passed_math'] / per_school_data_summary_df['students_per_school']*100
per_school_data_summary_df['% passing reading'] = per_school_data_summary_df['students_passed_reading'] / per_school_data_summary_df['students_per_school']*100

per_school_data_summary_df['per_student_budget'] = per_school_data_summary_df['students_passed_reading'] / per_school_data_summary_df['students_per_school']*100
per_school_data_summary_df.head()

,reading_score,math_score,students_passed_math,students_passed_reading,students_passing_both,students_per_school,school budget,school type,overall_passing_percentage,% passing math,% passing reading,per_student_budget
school_name,,,,,,,,,,,,
Bailey High School,81.033963,77.048432,3318,4077,2719,4976,3124928,District,54.642283,66.680064,81.933280,81.933280
Cabrera High School,83.975780,83.061895,1749,1803,1697,1858,1081356,Charter,91.334769,94.133477,97.039828,97.039828
Figueroa High School,81.158020,76.711767,1946,2381,1569,2949,1884411,District,53.204476,65.988471,80.739234,80.739234
Ford High School,80.746258,77.102592,1871,2172,1487,2739,1763916,District,54.289887,68.309602,79.299014,79.299014
Griffin High School,83.816757,83.351499,1371,1426,1330,1468,917500,Charter,90.599455,93.392371,97.138965,97.138965

In [48]:
per_school_summary_data_df = per_school_data_summary_df[['school type','students_per_school','school budget','per_student_budget','math_score',
                                                         'reading_score','% passing math','% passing reading','overall_passing_percentage']]
per_school_summary_data_df.head()

,school type,students_per_school,school budget,per_student_budget,math_score,reading_score,% passing math,% passing reading,overall_passing_percentage
school_name,,,,,,,,,
Bailey High School,District,4976,3124928,81.933280,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,1081356,97.039828,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,1884411,80.739234,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,1763916,79.299014,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,917500,97.138965,83.351499,83.816757,93.392371,97.138965,90.599455

In [49]:
per_school_data_summary_format_df = per_school_summary_data_df.copy()

In [50]:
per_school_data_summary_format_df.dtypes

school type                    object
students_per_school             int64
school budget                   int64
per_student_budget            float64
math_score                    float64
reading_score                 float64
% passing math                float64
% passing reading             float64
overall_passing_percentage    float64
dtype: object

In [51]:
per_school_data_summary_format_df.head()

,school type,students_per_school,school budget,per_student_budget,math_score,reading_score,% passing math,% passing reading,overall_passing_percentage
school_name,,,,,,,,,
Bailey High School,District,4976,3124928,81.933280,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,1081356,97.039828,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,1884411,80.739234,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,1763916,79.299014,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,917500,97.138965,83.351499,83.816757,93.392371,97.138965,90.599455

In [53]:
per_school_data_summary_format_df['students_per_school'] = per_school_data_summary_format_df['students_per_school'].map("%{:,.0f}".format)
per_school_data_summary_format_df['school budget'] = per_school_data_summary_format_df['school budget'].map("${:,.2f}".format)
per_school_data_summary_format_df['math_score'] = per_school_data_summary_format_df['math_score'].map("{:,.1f}".format)
per_school_data_summary_format_df['per_student_budget'] = per_school_data_summary_format_df['per_student_budget'].map("${:,.2f}".format)
per_school_data_summary_format_df['reading_score'] = per_school_data_summary_format_df['reading_score'].map("%{:,.1f}".format)
per_school_data_summary_format_df.head()

,school type,students_per_school,school budget,per_student_budget,math_score,reading_score,% passing math,% passing reading,overall_passing_percentage
school_name,,,,,,,,,
Bailey High School,District,"%4,976","$3,124,928.00",$81.93,77.0,%81.0,66.680064,81.933280,54.642283
Cabrera High School,Charter,"%1,858","$1,081,356.00",$97.04,83.1,%84.0,94.133477,97.039828,91.334769
Figueroa High School,District,"%2,949","$1,884,411.00",$80.74,76.7,%81.2,65.988471,80.739234,53.204476
Ford High School,District,"%2,739","$1,763,916.00",$79.30,77.1,%80.7,68.309602,79.299014,54.289887
Griffin High School,Charter,"%1,468","$917,500.00",$97.14,83.4,%83.8,93.392371,97.138965,90.599455